# Data Exploration

In [1]:
import warnings
warnings.filterwarnings("ignore")

import acquire

%run prepare.ipynb

In [2]:
# Split data into train (70%) & test (30%) samples. 
# You should end with 2 data frames: train_df and test_df

train_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
839,839,1,1,male,NaN,0,0,0.057971,0,First,Cherbourg,1
610,610,0,3,female,0.482650,1,5,0.061045,3,Third,Southampton,0
457,457,1,1,female,NaN,1,0,0.101229,3,First,Southampton,0
197,197,0,3,male,0.520505,0,1,0.016404,3,Third,Southampton,0
583,583,0,1,male,0.444795,0,0,0.078319,0,First,Cherbourg,1

In [3]:
test_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
149,149,0,2,male,0.520505,0,0,0.025374,3,Second,Southampton,1
373,373,0,1,male,0.268139,0,0,0.264739,0,First,Cherbourg,1
623,623,0,3,male,0.255521,0,0,0.015330,3,Third,Southampton,1
608,608,1,2,female,0.268139,1,2,0.081157,0,Second,Cherbourg,0
309,309,1,1,female,0.369085,0,0,0.111118,0,First,Cherbourg,1